{
	"description": "Create a snapshot of a file system.",
	"input_method": "stdin",
	"supports_noop": false,
	"remote": true,
	"parameters":{
			"access_policy":{
				"description": "File system security access policies. Each file system uses its access policy to determine how to reconcile the differences between NFS and SMB access control. Selecting an access policy determines which mechanism is used to enforce file security on the particular file system. * Native - Native Security. * UNIX - UNIX Security. * Windows - Windows Security.",
				"type":        "Optional[Enum['Native','UNIX','Windows']]",
				"default":     "Native"
			},
			"access_type":{
				"description": "Indicates whether the snapshot directory or protocol access is granted to the file system snapshot.* Snapshot- Snapshot access is via the .snapshot folder in the file system.* Protocol - Protocol access is via normal file shares. Protocol access is not provided by default - the NFS and/or SMB share must be created explicitly for the snapshot.",
				"type":        "Optional[Enum['Snapshot','Protocol']]",
				"default":     "Snapshot"
			},
			"description":{
				"description": "Snapshot description",
				"type":        "Optional[String[0,255]]"
			},
			"expiration_timestamp":{
				"description": "Time, when the snapshot will expire.",
				"type":        "Optional[String]"
			},
			"folder_rename_policy":{
				"description": "File system folder rename policies for the file system with multiprotocol access enabled. These policies control whether the directory can be renamed from NFS or SMB clients when at least one file is opened in the directory, or in one of its child directories. * All_Allowed - All protocols are allowed to rename directories without any restrictions. * SMB_Forbidden - A directory rename from the SMB protocol will be denied if at least one file is opened in the directory or in one of its child directories. * All_Forbidden - Any directory rename request will be denied regardless of the protocol used, if at least one file is opened in the directory or in one of its child directories.",
				"type":        "Optional[Enum['All_Allowed','SMB_Forbidden','All_Forbidden']]",
				"default":     "All_Forbidden"
			},
			"id":{
				"description": "File system id.",
				"type":        "String"
			},
			"is_async_m_time_enabled":{
				"description": "Indicates whether asynchronous MTIME is enabled on the protocol snaps that are mounted writeable. Values are:* true - Asynchronous MTIME is enabled on the file system.* false - Asynchronous MTIME is disabled on the file system.        ",
				"type":        "Optional[Boolean]"
			},
			"is_auto_delete_enabled":{
				"description": "Indicates whether the snapshot can be automatically deleted per threshold settings. Values are:* true - Snapshot can be automatically deleted per threshold settings.* false - Snapshot cannot be automatically deleted.",
				"type":        "Optional[Boolean]"
			},
			"is_smb_no_notify_enabled":{
				"description": "Indicates whether notifications of changes to a directory file structure are enabled.* true - Change directory notifications are enabled.* false - Change directory notifications are disabled.                      ",
				"type":        "Optional[Boolean]"
			},
			"is_smb_notify_on_access_enabled":{
				"description": "Indicates whether file access notifications are enabled on the file system. Values are:* true - File access notifications are enabled on the file system.* false - File access notifications are disabled on the file system.",
				"type":        "Optional[Boolean]"
			},
			"is_smb_notify_on_write_enabled":{
				"description": "Indicates whether file writes notifications are enabled on the file system. Values are:* true - File writes notifications are enabled on the file system.* false - File writes notifications are disabled on the file system.",
				"type":        "Optional[Boolean]"
			},
			"is_smb_op_locks_enabled":{
				"description": "Indicates whether opportunistic file locking is enabled on the file system. Values are:* true - Opportunistic file locking is enabled on the file system.* false - Opportunistic file locking is disabled on the file system.",
				"type":        "Optional[Boolean]"
			},
			"is_smb_sync_writes_enabled":{
				"description": "Indicates whether the synchronous writes option is enabled on the file system. Values are:* true - Synchronous writes option is enabled on the file system.* false - Synchronous writes option is disabled on the file system.",
				"type":        "Optional[Boolean]"
			},
			"locking_policy":{
				"description": "File system locking policies. These policy choices control whether the NFSv4 range locks are honored. Because NFSv3 is advisory by design, this policy specifies that the NFSv4 locking feature behaves like NFSv3 (advisory mode), for backward compatiblity with applications expecting an advisory locking scheme.   * Advisory - No lock checking for NFS and honor SMB lock range only for SMB. * Mandatory - Honor SMB and NFS lock range.",
				"type":        "Optional[Enum['Advisory','Mandatory']]",
				"default":     "Advisory"
			},
			"name":{
				"description": "Name of the snapshot. The default name of the snapshot is the date and time when the snapshot is taken.",
				"type":        "Optional[String[1,255]]"
			},
			"smb_notify_on_change_dir_depth":{
				"description": "Lowest directory level to which the enabled notifications apply, if any.",
				"type":        "Optional[Integer[1,512]]"
			}
	},

	"files": [
		"powerstore/lib/puppet/util/task_helper.rb",
		"powerstore/lib/puppet/transport/powerstore.rb",
		"powerstore/lib/puppet/transport/schema/powerstore.rb"
  ]

}
