{
	"description": "Modify the parameters of a volume.",
	"input_method": "stdin",
	"supports_noop": false,
	"remote": true,
	"parameters":{
			"description":{
				"description": "New description of the volume. This value must contain 128 or fewer printable Unicode characters.",
				"type":        "Optional[String[0,128]]"
			},
			"expiration_timestamp":{
				"description": "New expiration time of the snapshot. Expired snapshots are deleted by the snapshot aging service that runs periodically in the background. If not specified, the snapshot never expires.Use a maximum timestamp value to set an expiration to never expire.",
				"type":        "Optional[String]"
			},
			"force":{
				"description": "Normally a replication destination volume cannot be modified since it is controlled by replication. However, there can be cases where replication has failed or is no longer active and the replication destination volume needs to be cleaned up.With the force option, the user will be allowed to remove the protection policy from the replication destination volume provided that the replication session has never been synchronized and the last_sync_timestamp property is empty.This parameter defaults to false, if not specified.",
				"type":        "Optional[Boolean]",
				"default":     false
			},
			"id":{
				"description": "Unique identifier of the volume to modify.",
				"type":        "String"
			},
			"is_replication_destination":{
				"description": "New value for is_replication_destination property. The modification is only supported for primary and clone volume, only when the current value is true and there is no longer a replication session using this volume as a destination, and only to false.",
				"type":        "Optional[Boolean]"
			},
			"name":{
				"description": "New name of the volume. This value must contain 128 or fewer printable Unicode characters.",
				"type":        "Optional[String[0,128]]"
			},
			"node_affinity":{
				"description": "This attribute shows which node will be advertised as the optimized IO path to the volume. It is initially set to System_Select_At_Attach and can be modified to other values. When a volume is first attached to a host, if node_affinity is System_Select_At_Attach then the system will make the assignment to either System_Selected_Node_A or System_Selected_Node_B. The node_affinity may be modified to one of System_Select_At_Attach or Preferred_Node_A or Preferred_Node_B. Both System_Selected_Node_A and System_Selected_Node_B are reserved for system use only and cannot be set as the volume's node_affinity.Possible affinity for a volume. * System_Select_At_Attach - Volume currently has no node affinity, affinity will be assigned when the volume is first attached. * System_Selected_Node_A - System selected Node A as the optimized IO path to volume. * System_Selected_Node_B - System selected Node B as the optimized IO path to volume. * Preferred_Node_A - Node A will always advertise as the optimized IO path to volume. * Preferred_Node_B - Node B will always advertise as the optimized IO path to volume.",
				"type":        "Optional[Enum['System_Select_At_Attach','System_Selected_Node_A','System_Selected_Node_B','Preferred_Node_A','Preferred_Node_B']]"
			},
			"performance_policy_id":{
				"description": "Unique identifier of the performance policy assigned to the volume.",
				"type":        "Optional[String]"
			},
			"protection_policy_id":{
				"description": "Unique identifier of the protection policy assigned to the volume.",
				"type":        "Optional[String]"
			},
			"size":{
				"description": "New size of the volume in bytes,  must be a multiple of 8192, must be bigger than the current volume size. Maximum volume size is 256TB.",
				"type":        "Optional[Integer[8192,281474976710656]]"
			}},

	"files": [
		"powerstore/lib/puppet/util/task_helper.rb",
		"powerstore/lib/puppet/transport/powerstore.rb",
		"powerstore/lib/puppet/transport/schema/powerstore.rb"
  ]

}
