{
	"description": "Modify a volume group, snapshot set, or clone.",
	"input_method": "stdin",
	"supports_noop": false,
	"remote": true,
	"parameters":{
			"description":{
				"description": "New description for the volume group. The description should not have any unprintable characters.If an empty string is specified, the description will be cleared.",
				"type":        "Optional[String[1,256]]"
			},
			"force":{
				"description": "Normally a replication destination volume group cannot be modified since it is controlled by replication. However, there can be cases where replication has failed or is no longer active and the replication destination volume group needs to be cleaned up.With the force option, the user will be allowed to remove the protection policy from the replication destination volume group provided that the replication session has never been synchronized.This parameter defaults to false, if not specified.",
				"type":        "Optional[Boolean]",
				"default":     false
			},
			"id":{
				"description": "Unique identifier of the volume group.",
				"type":        "String"
			},
			"is_replication_destination":{
				"description": "New value for is_replication_destination property. is_replication_destination property of all the volumes in the volume group will be modified to the specified value. Modification of is_replication will not be transactional in nature. If the command only succeeds in modifying the is_replication_destination property of a subset of volumes, is_replication_destination property for the volume group will be set to true.Modification of this property is idempotent.This parameter is only valid when modifying a primary or a clone volume group, only when the volume group is no longer the destination of a replication session, and may only be set to false.",
				"type":        "Optional[Boolean]"
			},
			"is_write_order_consistent":{
				"description": "A boolean flag to indicate whether snapshot sets of the volume group will be write-order consistent.This parameter is only valid when modifying a primary or a clone volume group.",
				"type":        "Optional[Boolean]"
			},
			"name":{
				"description": "New name for the volume group. The name should contain no special HTTP characters and no unprintable characters. Although the case of the name provided is reserved, uniqueness check is case-insensitive, so the same name in two different cases is not considered unique.",
				"type":        "Optional[String[1,128]]"
			},
			"protection_policy_id":{
				"description": "Unique identifier of the protection policy to assign to a primary or clone volume group. If an empty string is specified, protection policy will be removed from the volume group.",
				"type":        "Optional[String]"
			}},

	"files": [
		"powerstore/lib/puppet/util/task_helper.rb",
		"powerstore/lib/puppet/transport/powerstore.rb",
		"powerstore/lib/puppet/transport/schema/powerstore.rb"
  ]

}
